_orgs/_posts/php/2018-09-19-php-sina-short-url.org
#+TITLE:  php sina short url 
#+AUTHOR:    zrg
#+EMAIL:     zrg1390556487@gmail.com
#+LANGUAGE:  cn
#+OPTIONS:   H:3 num:nil toc:nil \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:plain toc:t ltoc:t mouse:underline buttons:0 path:http://cs3.swfc.edu.cn/~20121156044/.org-info.js />
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://cs3.swfu.edu.cn/~20121156044/.org-manual.css" />
#+EXPORT_SELECT_TAGS: export
#+HTML_HEAD_EXTRA: <style>body {font-size:14pt} code {font-weight:bold;font-size:12px; color:darkblue}</style>
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 
#+XSLT: 

#+STARTUP: showall indent
#+STARTUP: hidestars
#+BEGIN_EXPORT HTML
---
layout: post
title: PHP 调用新浪API生成短链接 
author: zrg
description: 短链接生成
excerpt: 
comments: false
categories: 
- php
tags:
- PHP-新浪-短链接
---
#+END_EXPORT

# (setq org-export-html-use-infojs nil)
感谢您阅读此文，如果您发现任何错误，请发邮件至 zrg1390556487@gmail.com，谢谢！
# (setq org-export-html-style nil)

* API
+ http://api.t.sina.com.cn/short_url/shorten.json (返回结果是JSON格式) 
+ http://api.t.sina.com.cn/short_url/shorten.xml （返回结果是XML格式）
** 请求参数
+ source 申请应用时分配的AppKey，调用接口时代表应用的唯一身份。 
+ url_long 需要转换的长链接，需要URLencoded，最多不超过20个。
** 创建source方法 
1. 进入http://open.weibo.com/ ，选择菜单 微连接->网站接入。
2. 点击立即接入，创建新应用，随便填写应用名称，点击创建。
3. 创建成功后，AppKey就是source参数的值，可以用于请求创建短链接。
** 测试代码
#+CAPTION: 测试代码
#+BEGIN_SRC emacs-lisp
<?php
$api = 'http://api.t.sina.com.cn/short_url/shorten.json'; // json
// $api = 'http://api.t.sina.com.cn/short_url/shorten.xml'; // xml

$source = '您申请的AppKey';
$url_long = 'http://blog.csdn.net/fdipzone';

$request_url = sprintf($api.'?source=%s&url_long=%s', $source, $url_long);

$data = file_get_contents($request_url);
echo $data;
#+END_SRC
* References
+ [[https://blog.csdn.net/fdipzone/article/details/70832761][php 调用新浪API生成短链接]]
